app/views/users/index.html.erb

<!-- showページ範囲がない -->
<!-- avtion @user = User.find(params[:id]) -->
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]