app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
		</div>
		<!-- users index @users =User.all-->