app/views/books/index.html.erb

SELECT "books".* FROM "books"
---
		</div>
		<!-- book index @books =Book.all-->