app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    # book new
    @book = Book.new
    # books index
    # books index user 関連づけのid)
    # 質問する
    @books = Book.all

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ソースコード"], ["body", "gitについての基本操作から内部構造まで解説してくれます"], ["user_id", 1], ["created_at", "2020-07-06 04:41:40.555585"], ["updated_at", "2020-07-06 04:41:40.555585"]]
---
  def create
  	# book.newのためのcreate記述
  	book = Book.new(book_params)
    book.user_id = current_user.id
    book.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    # book new
    @book = Book.new
    # book show detail
    # エラーの原因
    @user = User.find(params[:id])
    # @bookで重複避ける
    @books = Book.find(params[:id])