app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
	def index
		# user show ログインしているユーザのみにする
		# 直接viewに書いたcurrent_user.name
		# @user = current_user
		# book new
		@book = Book.new
		# users index
		@users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		# user show ログインしているユーザのみにする
		# @user = User.find(params[:id])
		# @user = current_user
		# book new
		@book = Book.new
		# book index 関連づけ
		@user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "91bd3ee138fdf054ae171133b838a01bcb0a6b8a2256755ade0f96762bb2"], ["introduction", ""], ["updated_at", "2020-07-06 11:41:17.080294"], ["id", 1]]
---
	def update
		# 注意　updateだがインスタンス変数
		@user = User.find(params[:id])
		@user.update(user_params)